# Answered by Kevin Shahnazari

# Question 1

## Answer 1.A: There seem to be some outliers in the order dataset. From Eyeballing the data, we could see that there are two types of outliers. The first type is the result of a huge order quantity which could indicate those shops are probably wholesale stores, but further investigation is needed to validate this hypothesis. The second type of outliers occurs where the total items ordered are in the normal range, but the item's price is super high! 
## There are a few different approaches we could take here. One would be to remove the outliers that deviate from the mean more than three times the standard deviation to remove the outliers.

## Answer 1.B: The more straightforward approach here would be to use the median of data because it is more robust to outliers than the mean. Also, it doesn't have the complications of other algorithms such as the standard deviation, and it's easier to implement. The reason is that when there are outliers in the dataset, the data becomes skewed, and this affects the average. So the final used metric would be MOV (median order value)

In [19]:
import pandas as pd

In [20]:
data = pd.read_csv('data.csv')
data.head(6)

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
0,1,53,746,224,2,cash,2017-03-13 12:36:56
1,2,92,925,90,1,cash,2017-03-03 17:38:52
2,3,44,861,144,1,cash,2017-03-14 4:23:56
3,4,18,935,156,1,credit_card,2017-03-26 12:43:37
4,5,18,883,156,1,credit_card,2017-03-01 4:35:11
5,6,58,882,138,1,credit_card,2017-03-14 15:25:01

In [21]:
data.query("total_items > 500").head(10)

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
15,16,42,607,704000,2000,credit_card,2017-03-07 4:00:00
60,61,42,607,704000,2000,credit_card,2017-03-04 4:00:00
520,521,42,607,704000,2000,credit_card,2017-03-02 4:00:00
1104,1105,42,607,704000,2000,credit_card,2017-03-24 4:00:00
1362,1363,42,607,704000,2000,credit_card,2017-03-15 4:00:00
1436,1437,42,607,704000,2000,credit_card,2017-03-11 4:00:00
1562,1563,42,607,704000,2000,credit_card,2017-03-19 4:00:00
1602,1603,42,607,704000,2000,credit_card,2017-03-17 4:00:00
2153,2154,42,607,704000,2000,credit_card,2017-03-12 4:00:00
2297,2298,42,607,704000,2000,credit_card,2017-03-07 4:00:00

In [22]:
data.query("order_amount > 50000 and shop_id!=42").head()

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
490,491,78,936,51450,2,debit,2017-03-26 17:08:19
493,494,78,983,51450,2,cash,2017-03-16 21:39:35
511,512,78,967,51450,2,cash,2017-03-09 7:23:14
617,618,78,760,51450,2,cash,2017-03-18 11:18:42
691,692,78,878,154350,6,debit,2017-03-27 22:51:43

## Answer 1.C

In [18]:
data["order_amount"].median()

284.0

# The median order value is $284

# Question 2

## Question 2.A

In [ ]:
SELECT count(Orders.OrderID) FROM Orders
INNER JOIN Shippers ON Orders.ShipperID=Shippers.ShipperID 
WHERE Shippers.ShipperName="Speedy Express"

## There are 54 orders shipped with Speedy Express

## Question 2.B

In [ ]:
SELECT Employees.LastName FROM Employees 
LEFT JOIN Orders ON Employees.EmployeeID=Orders.EmployeeID
GROUP BY Orders.EmployeeID 
ORDER BY COUNT(Orders.CustomerID) DESC LIMIT 1

## The last name of the Employee is Peacock

## Question 2.C

In [ ]:
SELECT ProductName,OrderDetails.ProductID,sum(OrderDetails.Quantity) FROM OrderDetails
INNER JOIN Products ON OrderDetails.ProductID=Products.ProductID
WHERE OrderDetails.OrderID IN (
SELECT Orders.OrderID FROM Orders
INNER JOIN Customers ON Orders.CustomerID=Customers.CustomerID
WHERE Customers.Country="Germany") 
GROUP BY OrderDetails.ProductID ORDER BY sum(Quantity) DESC Limit 1

## The quantity order of product 40 Named (Boston Crab Meat) was the largest by costumers in Germany with a sum of 160.